cask_args no_quarantine: true

brew "antidote"
brew "delta"
brew "fd"
brew "fzf"
brew "git"
brew "helix"
brew "lazygit"
brew "markdown-oxide"
brew "ripgrep"
brew "starship"
brew "stow"
brew "uv"
brew "yazi"
brew "zellij"
brew "zsh"

cask "colemak-dh"
cask "discord"
cask "firefox"
cask "ghostty"
cask "obsidian"
cask "transmission"
cask "ungoogled-chromium"
cask "zed"
cask "zen"
