brew "antidote"
brew "delta"
brew "fd"
brew "ffmpeg-full"
brew "fzf"
brew "gh"
brew "git"
brew "helix"
brew "lazygit"
brew "markdown-oxide"
brew "nushell"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tree"
brew "uv"
brew "yazi"
brew "zellij"
brew "zsh"

cask "font-fira-mono-nerd-font"
cask "font-commit-mono-nerd-font"

cask "adguard"
cask "colemak-dh"
cask "firefox"
cask "flux-app"
cask "ghostty"
cask "obsidian"
cask "rectangle"
cask "zed"
cask "zen"

tap "hashicorp/tap"

brew "d2"
brew "hashicorp/tap/terraform", trusted: true
brew "mcp-toolbox"

cask "claude"
cask "claude-code"
cask "google-chrome"
cask "slack"
cask "visual-studio-code"

mas "Okta Verify", id: 490179405

# khan-dotfiles dump
tap "fastly/tap"
tap "khan/repo", trusted: true
brew "coreutils"
brew "go"
brew "imagemagick"
brew "mkcert"
brew "nss"
brew "openjdk@21"
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "python@3.11"
brew "redis", restart_service: :changed
brew "watchman"
brew "wget"
brew "fastly/tap/fastly", trusted: true
cask "docker-desktop"
